# ClearWebHeight Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionCParallelFlange..::..ClearWebHeight Property
StructuralSectionCParallelFlange Class See Also
---
Detailing depth between the web toes of the fillets, in.(mm)
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public double ClearWebHeight { get; set; }
```

Visual Basic
---
```text
Public Property ClearWebHeight As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double ClearWebHeight {
	double get ();
	void set (double value);
}
```

# See Also
StructuralSectionCParallelFlange Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace